# ImportDisplayUnits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportDisplayUnits Property
ParameterTypeId Class See Also
---
"Import Units"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportDisplayUnits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportDisplayUnits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportDisplayUnits {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace